const { createApp } = Vue;

createApp({
  data() {
    return {
      list: [
        {
          name: "青岛百发海水淡化厂二期扩建工程进入竣工验收准备阶段",
          content:
            "由益水公司牵头承建的青岛百发海水淡化厂二期扩建工程已进入竣工验收准备阶段，益水公司进一步提高思想认识，狠抓工作落实，全力推进百发海水淡化厂扩建工程竣工验收工作……",
        },
        {
          name: "青岛百发海水淡化厂二期扩建工程进入竣工验收准备阶段",
          content:
            "由益水公司牵头承建的青岛百发海水淡化厂二期扩建工程已进入竣工验收准备阶段，益水公司进一步提高思想认识，狠抓工作落实，全力推进百发海水淡化厂扩建工程竣工验收工作……",
        },
        {
          name: "青岛百发海水淡化厂二期扩建工程进入竣工验收准备阶段",
          content:
            "由益水公司牵头承建的青岛百发海水淡化厂二期扩建工程已进入竣工验收准备阶段，益水公司进一步提高思想认识，狠抓工作落实，全力推进百发海水淡化厂扩建工程竣工验收工作……",
        },
        {
          name: "青岛百发海水淡化厂二期扩建工程进入竣工验收准备阶段",
          content:
            "由益水公司牵头承建的青岛百发海水淡化厂二期扩建工程已进入竣工验收准备阶段，益水公司进一步提高思想认识，狠抓工作落实，全力推进百发海水淡化厂扩建工程竣工验收工作……",
        },
        {
          name: "青岛百发海水淡化厂二期扩建工程进入竣工验收准备阶段",
          content:
            "由益水公司牵头承建的青岛百发海水淡化厂二期扩建工程已进入竣工验收准备阶段，益水公司进一步提高思想认识，狠抓工作落实，全力推进百发海水淡化厂扩建工程竣工验收工作……",
        },
      ],
      currentPage: 1,
      pageSize: 10,
    };
  },
  mounted() {},
  methods: {
    handleSizeChange(val) {
      console.log(`每页 ${val} 条`);
    },
    handleCurrentChange(val) {
      console.log(`当前页: ${val}`);
    },
  },
})
  .use(ElementPlus, { locale: ElementPlusLocaleZhCn })
  .mount("#app");
